In [41]:
import numpy
import pandas as pd
import requests
import os
from matplotlib import pyplot as plt
from IPython.display import display

## Download Data

In [4]:
urls=['https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data',
     'https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.test',
     ]

In [3]:
folder = 'data'
if not os.path.exists(folder):
    os.makedirs(folder)

In [9]:
for url in urls:
    responce = requests.get(url)
    with open(os.path.join(folder,url.split('/')[-1]),'wb') as file:
        file.write(responce.content)

In [11]:
# Check
os.listdir(folder)

['adult.data', 'adult.test']

## Import data

In [12]:
columns=["age", "workClass", "fnlwgt", "education", "education_num","marital-status", "occupation", "relationship",
          "race", "sex", "capital-gain", "capital-loss", "hours_per_week", "native_country", "income"]

train_data = pd.read_csv('data/adult.data',sep= '\s*,\s*',names=columns)
test_data =pd.read_csv('data/adult.test',sep= '\s*,\s*',names=columns)

C:\Users\Salma Refaat\Anaconda3\lib\site-packages\ipykernel_launcher.py:4: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  after removing the cwd from sys.path.
C:\Users\Salma Refaat\Anaconda3\lib\site-packages\ipykernel_launcher.py:5: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  """

In [15]:
train_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
age               32561 non-null int64
workClass         32561 non-null object
fnlwgt            32561 non-null int64
education         32561 non-null object
education_num     32561 non-null int64
marital-status    32561 non-null object
occupation        32561 non-null object
relationship      32561 non-null object
race              32561 non-null object
sex               32561 non-null object
capital-gain      32561 non-null int64
capital-loss      32561 non-null int64
hours_per_week    32561 non-null int64
native_country    32561 non-null object
income            32561 non-null object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [16]:
test_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16282 entries, 0 to 16281
Data columns (total 15 columns):
age               16282 non-null object
workClass         16281 non-null object
fnlwgt            16281 non-null float64
education         16281 non-null object
education_num     16281 non-null float64
marital-status    16281 non-null object
occupation        16281 non-null object
relationship      16281 non-null object
race              16281 non-null object
sex               16281 non-null object
capital-gain      16281 non-null float64
capital-loss      16281 non-null float64
hours_per_week    16281 non-null float64
native_country    16281 non-null object
income            16281 non-null object
dtypes: float64(5), object(10)
memory usage: 1.9+ MB

In [17]:
full_data = train_data.append(test_data,ignore_index = True)
full_data.head()

,age,workClass,fnlwgt,education,education_num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours_per_week,native_country,income
0,39,State-gov,77516.0,Bachelors,13.0,Never-married,Adm-clerical,Not-in-family,White,Male,2174.0,0.0,40.0,United-States,<=50K
1,50,Self-emp-not-inc,83311.0,Bachelors,13.0,Married-civ-spouse,Exec-managerial,Husband,White,Male,0.0,0.0,13.0,United-States,<=50K
2,38,Private,215646.0,HS-grad,9.0,Divorced,Handlers-cleaners,Not-in-family,White,Male,0.0,0.0,40.0,United-States,<=50K
3,53,Private,234721.0,11th,7.0,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0.0,0.0,40.0,United-States,<=50K
4,28,Private,338409.0,Bachelors,13.0,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0.0,0.0,40.0,Cuba,<=50K

In [19]:
full_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48843 entries, 0 to 48842
Data columns (total 15 columns):
age               48843 non-null object
workClass         48842 non-null object
fnlwgt            48842 non-null float64
education         48842 non-null object
education_num     48842 non-null float64
marital-status    48842 non-null object
occupation        48842 non-null object
relationship      48842 non-null object
race              48842 non-null object
sex               48842 non-null object
capital-gain      48842 non-null float64
capital-loss      48842 non-null float64
hours_per_week    48842 non-null float64
native_country    48842 non-null object
income            48842 non-null object
dtypes: float64(5), object(10)
memory usage: 5.6+ MB

In [26]:
full_data[full_data.workClass.isnull()]

,age,workClass,fnlwgt,education,education_num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours_per_week,native_country,income
32561,|1x3 Cross validator,None,NaN,None,NaN,None,None,None,None,None,NaN,NaN,NaN,None,None

In [29]:
full_data.drop(full_data.index[32561],inplace=True)

In [30]:
full_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 48842 entries, 0 to 48842
Data columns (total 15 columns):
age               48842 non-null object
workClass         48842 non-null object
fnlwgt            48842 non-null float64
education         48842 non-null object
education_num     48842 non-null float64
marital-status    48842 non-null object
occupation        48842 non-null object
relationship      48842 non-null object
race              48842 non-null object
sex               48842 non-null object
capital-gain      48842 non-null float64
capital-loss      48842 non-null float64
hours_per_week    48842 non-null float64
native_country    48842 non-null object
income            48842 non-null object
dtypes: float64(5), object(10)
memory usage: 6.0+ MB

In [35]:
sum(full_data.duplicated())

29

In [38]:
full_data.drop_duplicates(inplace=True)

In [39]:
full_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 48813 entries, 0 to 48842
Data columns (total 15 columns):
age               48813 non-null object
workClass         48813 non-null object
fnlwgt            48813 non-null float64
education         48813 non-null object
education_num     48813 non-null float64
marital-status    48813 non-null object
occupation        48813 non-null object
relationship      48813 non-null object
race              48813 non-null object
sex               48813 non-null object
capital-gain      48813 non-null float64
capital-loss      48813 non-null float64
hours_per_week    48813 non-null float64
native_country    48813 non-null object
income            48813 non-null object
dtypes: float64(5), object(10)
memory usage: 6.0+ MB

In [40]:
sum(full_data.duplicated())

0

In [42]:
display(full_data.head(10))

,age,workClass,fnlwgt,education,education_num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours_per_week,native_country,income
0,39,State-gov,77516.0,Bachelors,13.0,Never-married,Adm-clerical,Not-in-family,White,Male,2174.0,0.0,40.0,United-States,<=50K
1,50,Self-emp-not-inc,83311.0,Bachelors,13.0,Married-civ-spouse,Exec-managerial,Husband,White,Male,0.0,0.0,13.0,United-States,<=50K
2,38,Private,215646.0,HS-grad,9.0,Divorced,Handlers-cleaners,Not-in-family,White,Male,0.0,0.0,40.0,United-States,<=50K
3,53,Private,234721.0,11th,7.0,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0.0,0.0,40.0,United-States,<=50K
4,28,Private,338409.0,Bachelors,13.0,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0.0,0.0,40.0,Cuba,<=50K
5,37,Private,284582.0,Masters,14.0,Married-civ-spouse,Exec-managerial,Wife,White,Female,0.0,0.0,40.0,United-States,<=50K
6,49,Private,160187.0,9th,5.0,Married-spouse-absent,Other-service,Not-in-family,Black,Female,0.0,0.0,16.0,Jamaica,<=50K
7,52,Self-emp-not-inc,209642.0,HS-grad,9.0,Married-civ-spouse,Exec-managerial,Husband,White,Male,0.0,0.0,45.0,United-States,>50K
8,31,Private,45781.0,Masters,14.0,Never-married,Prof-specialty,Not-in-family,White,Female,14084.0,0.0,50.0,United-States,>50K
9,42,Private,159449.0,Bachelors,13.0,Married-civ-spouse,Exec-managerial,Husband,White,Male,5178.0,0.0,40.0,United-States,>50K